Revit 2027 API
Zone.GetDomainData Method
 Gets the domain data for the zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ZoneElementDomainData GetDomainData()
Public Function GetDomainData As ZoneElementDomainData
public:
ZoneElementDomainData^ GetDomainData()
member GetDomainData : unit -> ZoneElementDomainData
Return Value
ZoneElementDomainData
 Returns a pointer to the base class for specific domain requirements for the zone.
See Also
Reference
Zone Class
Autodesk.Revit.DB.Mechanical Namespace